abolyyy/STM32_AIO/Source/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define sseg_a_Pin GPIO_PIN_0
#define sseg_a_GPIO_Port GPIOA
#define sseg_b_Pin GPIO_PIN_1
#define sseg_b_GPIO_Port GPIOA
#define sseg_c_Pin GPIO_PIN_2
#define sseg_c_GPIO_Port GPIOA
#define sseg_d_Pin GPIO_PIN_3
#define sseg_d_GPIO_Port GPIOA
#define sseg_e_Pin GPIO_PIN_4
#define sseg_e_GPIO_Port GPIOA
#define sseg_f_Pin GPIO_PIN_5
#define sseg_f_GPIO_Port GPIOA
#define sseg_g_Pin GPIO_PIN_6
#define sseg_g_GPIO_Port GPIOA
#define sseg_point_Pin GPIO_PIN_7
#define sseg_point_GPIO_Port GPIOA
#define sseg_dig_1_Pin GPIO_PIN_0
#define sseg_dig_1_GPIO_Port GPIOB
#define sseg_dig_2_Pin GPIO_PIN_1
#define sseg_dig_2_GPIO_Port GPIOB
#define sseg_dig_3_Pin GPIO_PIN_2
#define sseg_dig_3_GPIO_Port GPIOB
#define sseg_dig_4_Pin GPIO_PIN_3
#define sseg_dig_4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
